<?php

header("Content-Type:application/json");

$description = array(
	"性感90后豹纹内衣私房(24)", "sophie_reade_pie_face_41", "人物 美女 清纯", "冷笑话精选：最不愿迎合别人！", "____ Edifier .、诱惑", "，米合网www.meethere.cn", "妹子", "性感车模妖媚舞娘(9)", "美女", "小萝莉", "日韩,超短裙", "美腿", "小美女丝滑美腿(7)", "美女下", "特有气质的一组清纯美女生活照_美…", "非主流", "香车美女火辣上演销魂姿态(8)_www.…", "小美女丝滑美腿(5)", "美女", "美女", "妹子", "日韩", "美空", "una mujer(1)", "美女", "美女下", "超短裙", "制服", "una mujer(6)", "001", "菡@#丰韵娉婷精致优雅的漂亮美女", "比基尼", "无上装大尺度美女(6)", "king_zy采集到美女", "刚拍的漂亮美眉 上图_黑丝吧_百度…", "【夏日短发秀】：来自@请叫我99_美…", "古典美女，如花照水！【书画典藏】…", "超短裙", "欧美", "校花吧_百度贴吧", "Diana-Morales-2", "性感尤物大尺度化身古典美女 衣物…", "美空", "妹子", "性感90后豹纹内衣私房(48)", "2", "日韩", "制服", "极品女秘书！妖姬宅美女苏情！", "妹子", "007", "足球宝贝", "游戏靓妞丰满妖艳性感写真", "妹子", "美女|[www.3emm.com]_美女...", "妹子图", "性感90后豹纹内衣私房(25)", "妖姬宅美女王秋紫内衣拍摄花絮照！", "ALL", "妹子图", "潮包水桶包斜跨包", "初夏时光赵奕欢来自大海的声音（水…", "小萝莉清新萌照 纯纯惹人爱", "美空", "妹子", "品质女装2012夏装韩版裙子夏季中裙…", "长腿", "女", "放松放松！ _闲人1972的收集_我喜…", "曾暖馨运动宝贝-美女八卦-22MM图库…", "又到圣诞又到圣诞美女陪你过_文章_…", "妹子", "长腿", "012", "网络美女陈美行高清写真 - 美女贴…", "比基尼", "她算校花吗，有更新_看图_美女吧_…", "长腿", "妖姬宅美女陈怡凡真人四格漫画！", "超短裙", "【图】史上最全大学校花照片，挑个…", "高大丰满极品美女郑邱", "美女", "超短裙", "乌克兰“芭比娃娃”美女爆红网络-…", "甜美美少妇私房写真_文章_乱糟糟的…", "特有气质的一组清纯美女生活照_美…", "内衣", "混血", "无上装大尺度美女(5)", "自习室里总能发现美", "足球宝贝 刘羽琦12-体育美图,体育…", "欧美,ALL", "混血", "阿乔的性感小私房套图1(45)", "美女", "古典美女", "ALL", "惊艳模特靓丽比基尼秀(11)", "美女 | 图盒子 TuHeZi.com"
);

for ($i=0; $i < 100; $i++) { 
	$data[$i] = array(
		"src" => "images/" . ($i+1) . ".jpg",
		"des" => $description[$i]
	);
};

$request = $_POST["key"];

$tempResponse = array();

for ($j=0; $j < count($data); $j++) { 
	if(strpos($description[$j], $request)) {
		array_push($tempResponse,$data[$j]);
	}
}

$response = $tempResponse;

echo json_encode($response);